'''
a=b+11
# a,b,11 為運算元
# "="與"+"為運算子 (operator)

一. 指定運算子 :"=" 
'''

a = 11 #右邊的直放到左邊

'''
二. 算式運算子 :"+"，"-"，"*"，"/"，"//" #求商數，"%" #求餘數
'''
'''
三. "++"，"--" :加1 ，減1 => Python 不支援
   需使用 a = a+1
   a = 10 ; a=a+1 ;print(a)
說明 a=a+1  & a++的差異
#以下為組合語言的語法
mov : 將後面的資料，搬到前面
inc : 相加
==========================================
a=a+1          |         a++
===========================================
底下為組合語言    | 
mov ax, a      |         mov ax, a
mov bx, 1      |         xinc ax
inc cx, ax, bx |         mov a, ax
mov a, cx

->a++少了一道程序
'''
'''
四. 比較運算子  ">"，">="，"<"，"<="。"=="，"!="
'''
a=20 ;b=15
print(a>b)#,a<b,a==b,a!=b)

'''
五.邏輯運算子
   and :左右兩個都要為True，結果才會是Ture
   or  :左右只要一個都要為True，結果就為Ture
'''
print(True and False)
print(True or False)